# Data Merging

In [4]:
import pandas as pd
import numpy as np

data1={
    "id":[1,2,3],
    "Name":["Anees","Ali","Kamran"],
    "Age":[20,21,23]

}
df1=pd.DataFrame(data1)

data2={
    "id":[1,2,4],
    "city":["larkana","hyderabad","karachi"],
    "Occupation":["Student","Teacher","Doctor"]
}
df2=pd.DataFrame(data2)

data=pd.merge(df1,df2,on="id",how="inner")
data.head()

   id   Name  Age       city Occupation
0   1  Anees   20    larkana    Student
1   2    Ali   21  hyderabad    Teacher

# DATA Concatenation

In [16]:
data1={
    "Name":["Anees","Kamran","zain","azhar","kabeer"],
    "Age":[21,19,20,22,18]

}
daata2={
        "city":["larkana","hyderabad","karachi"],
       "Occupation":["Student","Teacher","Doctor"]

}



df1=pd.DataFrame(data1)
df2=pd.DataFrame(daata2)

data_concatenate_by_rows=pd.concat([df1,df2])

data_concatenate_by_columns=pd.concat([df1,df2],axis=1)





print("data concatenationn by rows  \n\n")
print(data_concatenate_by_rows,"\n")

print("data concatenationn by coulumns  \n\n")
data_concatenate_by_columns

data concatenationn by rows


     Name   Age       city Occupation
0   Anees  21.0        NaN        NaN
1  Kamran  19.0        NaN        NaN
2    zain  20.0        NaN        NaN
3   azhar  22.0        NaN        NaN
4  kabeer  18.0        NaN        NaN
0     NaN   NaN    larkana    Student
1     NaN   NaN  hyderabad    Teacher
2     NaN   NaN    karachi     Doctor

data concatenationn by coulumns

     Name  Age       city Occupation
0   Anees   21    larkana    Student
1  Kamran   19  hyderabad    Teacher
2    zain   20    karachi     Doctor
3   azhar   22        NaN        NaN
4  kabeer   18        NaN        NaN